import numpy as np

a = np.array([
    [[1,1,1,10],
     [2,2,2,20],
     [3,3,3,30]
    ],

    [[4,4,4,40],
     [5,5,5,50],
     [6,6,6,60]
    ],
])

b = a.reshape(2*3,-1)  # [6, x=4]
c = a.reshape(-1,3*4)  # [x=2, 12]
d = a.reshape(2*4,-1)  # 第三个维度乱套 [8, x=3]

e = a.reshape(-1)  # [x=24, ]
f = a.reshape(1,-1)  # [1, x=24]
g = a.reshape(-1,1)  # [x=24, 1]

h = a.reshape(3,2,4)  # 在保持第三个维度的情况下重新分配前两个维度
i = a.reshape(2,4,3)  # 第三个维度乱套
j = a.reshape(3,4,2)  # 第三个维度乱套
k = a.reshape(4,2,3)  # 第三个维度乱套
l = a.reshape(4,3,2)  # 第三个维度乱套

m = a[1,...]  # 失去了第一个维度 [2, 3]
n = a[:,:2,:]  # [2,2,4]
o = a[...,2:]  # [2,3,2]

p = a[:,2,:]  # 失去了第二个维度 [2, 4]
q = a[...,3]  # 失去了第三个维度 [2, 3]

r = a.reshape(-1,4)

aa = np.linspace(1,40,40).repeat(3)